# Задание 8 Англо-латинский словарь. Однажды, разбирая старые книги
# на чердаке, школьник Вася нашёл англо-латинский словарь. Английский он к
# тому времени знал в совершенстве, и его мечтой было изучить латынь.
# Поэтому попавшийся словарь был как раз кстати.
# К сожалению, для полноценного изучения языка недостаточно только
# одного словаря: кроме англо-латинского необходим латинско-английский. За
# неимением лучшего он решил сделать второй словарь из первого.
# Как известно, словарь состоит из переводимых слов, к каждому из
# которых приводится несколько слов-переводов. Для каждого латинского
# слова, встречающегося где-либо в словаре, Вася предлагает найти все его
# переводы(то есть все английские слова, для которых наше латинское
#          встречалось в его списке переводов), и считать их и только их переводами
# этого латинского слова.
# Помогите Васе выполнить работу по созданию латинско-английского
# словаря из англо-латинского.
# В первой строке содержится единственное целое число – количество
# английских слов в словаре. Далее следует описаний. Каждое описание
# содержится в отдельной строке, в которой записано сначала английское слово,
# затем отделённый пробелами дефис, затем разделённые запятыми с пробелами
# переводы этого английского слова на латинский. Все слова состоят только из
# маленьких латинских букв. Переводы отсортированы в лексикографическом
# порядке. Порядок следования английских слов в лексикографический.
# Выведите соответствующий данному латинско-английский словарь, в
# точности соблюдая формат входных данных. В частности, первым должен перевод
# лексикографически минимального латинского далее – второго в этом порядке и т.д.
# Внутри перевода английские слова должны быть также отсортированы лексикографически.
# Входные данные
# 3
# apple - malum, pomum, popula
# fruit - baca, bacca, popum
# punishment - malum, multa
# Правильный ответ
# 7
# baca - fruit
# bacca - fruit
# malum - apple, punishment
# multa - punishment
# pomum - apple
# popula - apple
# popum - fruit


n = int(input())
d = {str: []}
for key in range(n):
    s = input().split(' - ')
    d[s[0]] = s[1].split(', ')

d2 = {}
for key in d:
    for value in d[key]:
        if value in d2:
            d2[value].append(key)
        else:
            d2[value] = [key]

print(len(d2))
for key in sorted(d2):
    print(key, '-', ', '.join(sorted(d2[key])))
